export const gender = {
  '50601': '未知的性别',
  '50602': '男性',
  '50603': '女性',
  '50604': '未说明的性别'
}
export const statusText = {
  '960074': '新建',
  '390030405': '已保存',
  '399297355': '已提交',
  '399017130': '审签中',
  // '390032002': '二次审核',
  '390030407': '审核通过', //一次审核
  '399297358': '审签驳回',
  '399291265': '已召回',
  '399572897': '已封存',
  '399572894': '已打印',
  '1001': '编辑中'
  // '1': '已打印',
  // '1002': 'CA签名',
}
export const CasesInTheInput = {
  // 'WIN1.347743.11844':'orgName', //医院名称
  // 'WIN1.347720.375821':'fullName', //姓名
  // 'WIN1.347720.10050':'genderCodeName', //性别
  // 'WIN1.347720.10000':'age', //年龄
  // 'WIN1.347722.10253':'currentDeptName', //科室
  // 'WIN1.347724.399329910':'bedNo', //床号
  // 'WIN1.347722.10314':'imrn', //住院号
  // 'WIN1.347720.10052':'maritalStatus', //婚姻
  // 'WIN1.347722.10277':'admittedAt', //入院日期
  // 'SYS00.154':'birthAddress', //籍贯（出生地）
  // 'WIN1.347720.10094':'occupationName', //职业
  // 'WIN1.347720.10067':'nationName', //民族
  // // 'E20160331182852':'', //病史陈述者
  // 'WIN1.347743.11384':'createdAt', //记录日期(病程记录时间)
  // 'WIN62.00.04':'diagnosticMessage', //诊断信息
  '399336188': 'inpatEmrSetFileTime', //病程记录时间
  '399336187': 'inpatEmrSetTitle', //病程记录标题
  '399001367': 'inpEmrCvAdviceContent' //住院病程记录日常病程记录
  // 'WIN1.347724.399303417':'consultTypeCode' ,//会诊类型
  // 'WIN1.347751.399331942':'consultLevelCode', //会诊级别
  // 'WIN1.347724.10466':'consultPurpose', //简要病情描述（会诊）
  // 'WIN1.347751.11576':'consultPurpose', //会诊目的
  // 'WIN1.347751.11577':'applyConsultAt', //会诊日期时间
  // 'WIN1.347751.11574':'invitedDeptIds', //被邀会诊科室
  // 'WIN1.347751.11583':'', //会诊医师
  // 'WIN1.347751.11578':'', //会诊申请科室
  // 'WIN1.384017.399331220':'', //医师签名
}
export const maritalStatusList = {
  '50605': '未婚',
  '50606': '已婚',
  '50607': '初婚',
  '50608': '再婚',
  '50609': '复婚',
  '50610': '丧偶',
  '101247': '离婚',
  '101248': '未说明的婚姻情况'
}

// export const personDrawerFocusItem = {
//   '391004206': '4304926371', //姓名
//   '391004207': '4304926372', //性别
//   '391002350': '4304926379', //民族
//   '391002215': '4304926382', //婚姻
//   '391003846': '4304926381', //职业
//   '399301388': '4304953861', //工作单位
//   '399392623': '1622545444946290635', //籍贯
//   '399317169': '4304926377', //住址
//   '399336323': '163524096719389290', //居住地
//   '399392619': '1622545451556888007', //出生地
//   '391004208': '1632556505870112492', //年龄
//   '399336330': '1622545451556888007' //出生地
// }

//枚举已使用的监控类型id
export const inpMrtMonitorIdEnum = {
  WZBR_APACHE: '203901183149915905', //危重病人APACHE
  SSJLD: '125044678493294650', //手术记录单
  RYJL: '125044678493294618', //入院记录
  SWJL: '125044680640778264', //死亡记录
  RYSWJL_IN24HOURS: '125044678493294626', //24小时内入院死亡记录
  VTE_PGLB: '181121796631140302', //VTE评估量表
  LCLJ_ZQTYS: '203901183149915907', //临床路径知情同意书
  EJYSCFJL: '125044676345810988', //二级医师查房记录
  BABY_RECORD: '125044680640778398', //婴儿记录
  ZCJL: '125044676345811008',   //转出记录
  ZRJL: '125044676345811010',   //转入记录
}
